In [1]:
import pandas as pd

In [3]:
test = pd.read_csv('data/aug_test.csv')
train = pd.read_csv('data/aug_train.csv')

In [4]:
print('Test Shape')
print(test.shape)

Test Shape
(2129, 13)

In [5]:
print('Train Shape')
print(train.shape)
train.head()

Train Shape
(19158, 14)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

In [7]:
# Separate Target and Features
y = train['target']
X = train.drop('target', axis=1)

In [8]:
# List Features
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
dtypes: float64(1), int64(2), object(10)
memory usage: 1.9+ MB

In [15]:
X.describe()

        enrollee_id  city_development_index  training_hours
count  19158.000000            19158.000000    19158.000000
mean   16875.358179                0.828848       65.366896
std     9616.292592                0.123362       60.058462
min        1.000000                0.448000        1.000000
25%     8554.250000                0.740000       23.000000
50%    16982.500000                0.903000       47.000000
75%    25169.750000                0.920000       88.000000
max    33380.000000                0.949000      336.000000

In [9]:
# Examine Target
y.value_counts()

0.0    14381
1.0     4777
Name: target, dtype: int64

In [13]:
# Percent Positive
print("Percent Positive Targets:")
percent_pos = y.value_counts()[1]/len(y)
percent_pos

Percent Positive Targets:

0.24934753105752167